# Concatenar y apendizar data sets

In [1]:
import pandas as pd
import os

Data Set Information:

These data are the results of a chemical analysis of wines grown in the same region in Italy but derived from three different cultivars. The analysis determined the quantities of 13 constituents found in each of the three types of wines. 

I think that the initial data set had around 30 variables, but for some reason I only have the 13 dimensional version. I had a list of what the 30 or so variables were, but a.) I lost it, and b.), I would not know which 13 variables are included in the set. 

The attributes are (dontated by Riccardo Leardi, riclea '@' anchem.unige.it ) 

1. Alcohol 
2. Malic acid 
3. Ash 
4. Alcalinity of ash 
5. Magnesium 
6. Total phenols 
7. Flavanoids 
8. Nonflavanoid phenols 
9. Proanthocyanins 
10. Color intensity 
11. Hue 
12. OD280/OD315 of diluted wines 
13. Proline 

In a classification context, this is a well posed problem with "well behaved" class structures. A good data set for first testing of a new classifier, but not very challenging.


Attribute Information:

All attributes are continuous 

No statistics available, but suggest to standardise variables for certain uses (e.g. for us with classifiers which are NOT scale invariant) 

NOTE: 1st attribute is class identifier (1-3)

In [2]:
mainpath = "E:/Curso de Python/Repositorio/python-ml-course/datasets/"
white_path = "wine/winequality-white.csv"
red_path = "wine/winequality-red.csv"
withe_wine_data = pd.read_csv(os.path.join(mainpath,white_path), sep = ';')
red_wine_data = pd.read_csv(os.path.join(mainpath, red_path), sep = ';')

In [3]:
red_wine_data.head()

,fixed acidity,volatile acidity,citric acid,residual sugar,chlorides,free sulfur dioxide,total sulfur dioxide,density,pH,sulphates,alcohol,quality
0,7.4,0.70,0.00,1.9,0.076,11.0,34.0,0.9978,3.51,0.56,9.4,5
1,7.8,0.88,0.00,2.6,0.098,25.0,67.0,0.9968,3.20,0.68,9.8,5
2,7.8,0.76,0.04,2.3,0.092,15.0,54.0,0.9970,3.26,0.65,9.8,5
3,11.2,0.28,0.56,1.9,0.075,17.0,60.0,0.9980,3.16,0.58,9.8,6
4,7.4,0.70,0.00,1.9,0.076,11.0,34.0,0.9978,3.51,0.56,9.4,5

In [4]:
withe_wine_data.head()

,fixed acidity,volatile acidity,citric acid,residual sugar,chlorides,free sulfur dioxide,total sulfur dioxide,density,pH,sulphates,alcohol,quality
0,7.0,0.27,0.36,20.7,0.045,45.0,170.0,1.0010,3.00,0.45,8.8,6
1,6.3,0.30,0.34,1.6,0.049,14.0,132.0,0.9940,3.30,0.49,9.5,6
2,8.1,0.28,0.40,6.9,0.050,30.0,97.0,0.9951,3.26,0.44,10.1,6
3,7.2,0.23,0.32,8.5,0.058,47.0,186.0,0.9956,3.19,0.40,9.9,6
4,7.2,0.23,0.32,8.5,0.058,47.0,186.0,0.9956,3.19,0.40,9.9,6

En python, tenemos dos tipos de ejes:
* axis = 0, denota el eje horizontal.
* axis = 1, denota el eje horizontal.

In [5]:
wine_data = pd.concat([red_wine_data, withe_wine_data], axis = 0)

In [6]:
wine_data.shape

(6497, 12)

In [7]:
wine_data.head()

,fixed acidity,volatile acidity,citric acid,residual sugar,chlorides,free sulfur dioxide,total sulfur dioxide,density,pH,sulphates,alcohol,quality
0,7.4,0.70,0.00,1.9,0.076,11.0,34.0,0.9978,3.51,0.56,9.4,5
1,7.8,0.88,0.00,2.6,0.098,25.0,67.0,0.9968,3.20,0.68,9.8,5
2,7.8,0.76,0.04,2.3,0.092,15.0,54.0,0.9970,3.26,0.65,9.8,5
3,11.2,0.28,0.56,1.9,0.075,17.0,60.0,0.9980,3.16,0.58,9.8,6
4,7.4,0.70,0.00,1.9,0.076,11.0,34.0,0.9978,3.51,0.56,9.4,5

# Datos Distribuidos

In [8]:
data = pd.read_csv(os.path.join(mainpath,"distributed-data/001.csv"))
data.head()

         Date  sulfate  nitrate  ID
0  2003-01-01      NaN      NaN   1
1  2003-01-02      NaN      NaN   1
2  2003-01-03      NaN      NaN   1
3  2003-01-04      NaN      NaN   1
4  2003-01-05      NaN      NaN   1

In [9]:
df_list = []
folder = "distributed-data"
for i in range (1,333):
    if i < 10:
        file = "00" + str(i) + ".csv"
    elif i < 100:
        file = "0" + str(i) + ".csv"
    else: 
        file = str(i) + ".csv"
    path = os.path.join(mainpath, folder, file)
    df_list.append(pd.read_csv(path))
data = pd.concat(df_list, axis = 0)
data.shape

(772087, 4)

In [10]:
data.tail()

           Date  sulfate  nitrate   ID
726  2004-12-27      NaN      NaN  332
727  2004-12-28      NaN      NaN  332
728  2004-12-29      NaN      NaN  332
729  2004-12-30      NaN      NaN  332
730  2004-12-31      NaN      NaN  332

           Date  sulfate  nitrate  ID
0    2003-01-01      NaN      NaN   1
1    2003-01-02      NaN      NaN   1
2    2003-01-03      NaN      NaN   1
3    2003-01-04      NaN      NaN   1
4    2003-01-05      NaN      NaN   1
..          ...      ...      ...  ..
361  2000-12-27      NaN      NaN  55
362  2000-12-28      NaN      NaN  55
363  2000-12-29     1.72    0.893  55
364  2000-12-30      NaN      NaN  55
365  2000-12-31      NaN      NaN  55

[20090 rows x 4 columns]

# Join de datasets

In [11]:
folder = "athletes"

In [12]:
data_main = pd.read_csv(os.path.join(mainpath,folder,"Medals.csv"), encoding = "ISO-8859-1")
data_main.head()

,Athlete,Age,Year,Closing Ceremony Date,Gold Medals,Silver Medals,Bronze Medals,Total Medals
0,Michael Phelps,23.0,2008,08/24/2008,8,0,0,8
1,Michael Phelps,19.0,2004,08/29/2004,6,0,2,8
2,Michael Phelps,27.0,2012,08/12/2012,4,2,0,6
3,Natalie Coughlin,25.0,2008,08/24/2008,1,2,3,6
4,Aleksey Nemov,24.0,2000,10/01/2000,2,1,3,6

In [13]:
a = data_main["Athlete"].unique().tolist()
len(a)

6956

In [14]:
data_main.shape

(8618, 8)

In [15]:
data_country = pd.read_csv(os.path.join(mainpath, folder, "Athelete_Country_Map.csv"), encoding = "ISO-8859-1")
data_country.head()

            Athlete        Country
0    Michael Phelps  United States
1  Natalie Coughlin  United States
2     Aleksey Nemov         Russia
3     Alicia Coutts      Australia
4    Missy Franklin  United States

In [16]:
len(data_country)

6970

In [17]:
data_country[data_country["Athlete"] == "Aleksandar Ciric"]

               Athlete                Country
1029  Aleksandar Ciric                 Serbia
1086  Aleksandar Ciric  Serbia and Montenegro

In [18]:
data_sports = pd.read_csv(os.path.join(mainpath,folder,"Athelete_Sports_Map.csv"), encoding = "ISO-8859-1")
data_sports.head()

            Athlete       Sport
0    Michael Phelps    Swimming
1  Natalie Coughlin    Swimming
2     Aleksey Nemov  Gymnastics
3     Alicia Coutts    Swimming
4    Missy Franklin    Swimming

In [19]:
len(data_sports)

6975

In [20]:
len(data_sports["Athlete"].unique().tolist())

6956

In [21]:
data_sports[
        (data_sports["Athlete"] == "Chen Jing") | 
        (data_sports["Athlete"] == "Richard Thompson") | 
        (data_sports["Athlete"] == "Matt Ryan")
    ]

               Athlete         Sport
528   Richard Thompson     Athletics
1308         Chen Jing    Volleyball
1419         Chen Jing  Table Tennis
2727         Matt Ryan        Rowing
5003         Matt Ryan    Equestrian
5691  Richard Thompson      Baseball

# Concatenar los datos con merge

In [25]:
data_country_dp = data_country.drop_duplicates(subset = "Athlete")

In [26]:
data_country_dp[data_country_dp["Athlete"] == "Aleksandar Ciric"]

               Athlete Country
1029  Aleksandar Ciric  Serbia

In [29]:
data_main_country = pd.merge(left = data_main, right = data_country_dp, 
                    left_on = "Athlete", right_on = "Athlete")
data_main_country.head()

,Athlete,Age,Year,Closing Ceremony Date,Gold Medals,Silver Medals,Bronze Medals,Total Medals,Country
0,Michael Phelps,23.0,2008,08/24/2008,8,0,0,8,United States
1,Michael Phelps,19.0,2004,08/29/2004,6,0,2,8,United States
2,Michael Phelps,27.0,2012,08/12/2012,4,2,0,6,United States
3,Natalie Coughlin,25.0,2008,08/24/2008,1,2,3,6,United States
4,Natalie Coughlin,21.0,2004,08/29/2004,2,2,1,5,United States

In [30]:
data_main_country[data_main_country["Athlete"] == "Aleksandar Ciric"] # Hace un inner join

,Athlete,Age,Year,Closing Ceremony Date,Gold Medals,Silver Medals,Bronze Medals,Total Medals,Country
1491,Aleksandar Ciric,30.0,2008,08/24/2008,0,0,1,1,Serbia
1492,Aleksandar Ciric,26.0,2004,08/29/2004,0,1,0,1,Serbia
1493,Aleksandar Ciric,22.0,2000,10/01/2000,0,0,1,1,Serbia

In [32]:
data_main_country.shape

(8618, 9)

In [33]:
data_sports_dp = data_sports.drop_duplicates(subset = "Athlete")

In [34]:
data_sports_dp.shape

(6956, 2)

In [35]:
data_final = pd.merge(left = data_main_country, right = data_sports_dp, left_on = "Athlete", right_on = "Athlete")

In [36]:
data_final.head()

,Athlete,Age,Year,Closing Ceremony Date,Gold Medals,Silver Medals,Bronze Medals,Total Medals,Country,Sport
0,Michael Phelps,23.0,2008,08/24/2008,8,0,0,8,United States,Swimming
1,Michael Phelps,19.0,2004,08/29/2004,6,0,2,8,United States,Swimming
2,Michael Phelps,27.0,2012,08/12/2012,4,2,0,6,United States,Swimming
3,Natalie Coughlin,25.0,2008,08/24/2008,1,2,3,6,United States,Swimming
4,Natalie Coughlin,21.0,2004,08/29/2004,2,2,1,5,United States,Swimming

In [37]:
data_final.shape

(8618, 10)